| Revue de code                                                  |                                                               |           |    |      |                                                    |
|                                                                |                                                               |           |    |      |                                                    |
| Pertinence des commentaires                                    |                                                               |         6 | A  |  6.0 | Très bien                                          |
| Exhaustivité de la révision                                    |                                                               |         6 | A  |  6.0 |                                                    |
| Formulation appropriée et respectueuse                         |                                                               |         6 | A  |  6.0 |                                                    |
|----------------------------------------------------------------+---------------------------------------------------------------+-----------+----+------+----------------------------------------------------|
| Développement                                                  |                                                               |           |    |      |                                                    |
|                                                                |                                                               |           |    |      |                                                    |
| Pertinence et justesse de l’intégration des éléments demandés  |                                                               |           |    |      |                                                    |
|                                                                | Les erreurs sont correctement représentées par des images     |         5 | A  |  5.0 |                                                    |
|                                                                | Les boutons «lettres» permettent de faire des essais          |         5 | A  |  5.0 |                                                    |
|                                                                | Seulement les lettres trouvées sont affichées dans le mot     |         5 | A  |  5.0 |                                                    |
|                                                                | Il n'est pas possible d'essayer plusieurs fois la même lettre |         5 | A  |  5.0 |                                                    |
|                                                                | Un bouton «Redémarrer» relance le jeu                         |         5 | A  |  5.0 |                                                    |
|                                                                | L'interface est internationalisée                             |         5 | A  |  5.0 |                                                    |
| Qualité de la solution développée                              |                                                               |           |    |      |                                                    |
|                                                                | La classe Jeu est implémentée selon l'analyse                 |         6 | B+ |  5.2 |                                                    |
|                                                                | La classe Présentateur est implémentée selon l'analyse        |         6 | B  |  4.8 | Fait une partie du travail de la vue               |
|                                                                | La classe MainActivity implémente la vue seulement            |         6 | A  |  6.0 |                                                    |
|                                                                | Les méthodes publiques sont documentées                       |         6 | C  |  3.6 | En partie                                          |
| Qualité et exhaustivité des tests                              |                                                               |           |    |      |                                                    |
|                                                                | La classe Jeu est testée par des tests unitaires:             |           |    |      |                                                    |
|                                                                | Corrects                                                      |         6 | A  |  6.0 |                                                    |
|                                                                | Complets                                                      |         6 | B  |  4.8 | Il en manque quelques-uns (estRéussi, par exemple) |
|                                                                | Dans le format demandé                                        |         6 | A  |  6.0 |                                                    |
| Utilisation adéquate des outils de gestion de projet           |                                                               |           |    |      |                                                    |
|                                                                | Le travail est séparé en commits                              |         5 | A  |  5.0 |                                                    |
|                                                                | Les commits sont documentés                                   |         5 | A  |  5.0 |                                                    |
|----------------------------------------------------------------+---------------------------------------------------------------+-----------+----+------+----------------------------------------------------|
| Qualité du français                                            |                                                               | (max -10) |    |      |                                                    |
|----------------------------------------------------------------+---------------------------------------------------------------+-----------+----+------+----------------------------------------------------|
| Le code respecte les normes de qualité                         |                                                               | (max -20) |    |      |                                                    |
|----------------------------------------------------------------+---------------------------------------------------------------+-----------+----+------+----------------------------------------------------|
| TOTAL                                                          |                                                               |       100 |    | 94.4 | Excellent!                                         |
#+TBLFM: @3$5..@27$5='(if (string= "" $4) "" (format "%2.1f" (* (string-to-number $3) (/ (+ (- 70 (aref $4 0)) (cond ((= (aref (substring $4 -1) 0) ?+) 0.33) ((= (aref (substring $4 -1) 0) ?-) -0.33) (t 0))) 5.0))))'
#+TBLFM: @30$5=vsum(@3..@29)

